Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཆོས་འཛིན་དབྱངས་བཟངས་རིམ་གྲོ་པ་ཡང་ཡིན། །
en: Excellent Melody of Dharma will be his attendant.

source: རིན་ཆེན་དགའ་ཞེས་བྱ་བ་ཤེས་རབ་ཅན། །བརྟན་པས་བྱིན་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: Jewel Joy will be the one of insight “And Gift of the Stable the one of miracles.

source: འདུས་པ་དང་པོར་དྲི་གསུམ་བྲལ་བའི་ཚོགས། །བྱེ་བ་སུམ་ཅུ་རྩ་དྲུག་གཉིས་པར་ཡང་། །སུམ་ཅུ་རྩ་ལྔ་གསུམ་པར་སུམ་ཅུ་བཞི། །
en: In the first congregation of those free from the three stains Will assemble three hundred sixty million, In the second three hundred fifty million, and in the third three hundred forty million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་བདུན། །
en: “His lifespan will be seventy-seven thousand years,

source: སྐྱེས་མཆོག་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་བྱེ་དྲུག་ཅུ་གཉིས་སུ་གནས། །
en: And when this supreme being has attained parinirvāṇa The sacred Dharma will remain for six hundred twenty million years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །རྒྱལ་མཚན་བྱེ་བ་བརྒྱ་ཡིས་བརྒྱན་པར་འགྱུར། །
en: There will be a single stūpa dedicated to nirvāṇa, “Adorned with a billion banners.

source: དེ་བཞིན་གཤེགས་པ་རུ་རིངས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་དཔལ་ལྡན་གསལ་བ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Viṣāṇin will be born In a place called Glorious Luminosity.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །
en: His family will be kṣatriya, “And his light will extend thirty-two leagues.

source: དཔག་ཚད་སུམ་ཅུ་རྩ་གཉིས་འབྱོར་ལྡན་ཡབ། །ཡོན་ཏན་མཐའ་ཡས་ཡུམ་ཡིན་སྲས་པོ་ནི། །བྱང་ཆུབ་དགའ་ཡིན་དཔལ་ཅན་རིམ་གྲོ་པ། །
en: Endowed with Wealth will be his father and Infinite Qualities his mother. Joy of Awakening will be his son and Glorious his attendant.

source: སོ་རིངས་ཞེས་ནི་བྱ་བ་ཤེས་རབ་ཅན། །
en: Swift Sharpness will be the one of insight

source: སྣ་མའི་མེ་ཏོག་འོད་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Jasmine Flower the one of miracles.

source: འདུས་པ་དང་པོར་ཉན་ཐོས་བསམ་གཏན་པ། །སྟོང་ཕྲག་བཞི་བཅུ་རྩ་དྲུག་གཉིས་པར་ཡང་། །སུམ་ཁྲི་ལྔ་སྟོང་གསུམ་པར་དྲུག་ཁྲི་ཡོད། །
en: In the first congregation will gather Forty-six thousand hearers endowed with meditation. In the second will be thirty-five thousand and in the third sixty thousand.

source: དེ་ཚེ་མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་ཡིན། །
en: At that time the lifespan of humans will be eighty thousand years,

source: རྐང་གཉིས་མཆོག་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བྱེ་བར་གནས། །
en: “And when that supreme human has attained nirvāṇa The sacred Dharma will remain ten million years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་སུམ་ཅུ་ལྔ། །
en: His relics will be abundant, And there will be thirty-five billion stūpas.

source: གང་ཟག་མཚུངས་མེད་ཡོན་ཏན་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་སྒྲོན་ཞེས་བྱ། །
en: “The incomparable person Guṇakīrti Will be born in a place called Jewel Lamp.

source: འདྲེན་པའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ལེགས་པའི་ལྷ། །ཤིན་ཏུ་མཛེས་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: The family of this guide will be kṣatriya And his light will extend three leagues. “God of Excellence will be his father and Extreme Beauty his mother.

source: སྲས་པོ་རིན་ཆེན་དྲང་སྲོང་རིམ་གྲོ་པ། །
en: Jewel will be his son and Sage his attendant.

source: སྤོབས་དགའ་ཞེས་བྱ་ཤེས་རབ་ཅན་གྱི་མཆོག །
en: Eloquent Joy will be the one of insight

source: ཡེ་ཤེས་དབང་ཕྱུག་རྫུ་འཕྲུལ་ཅན་གྱི་མཆོག །
en: And Wisdom Master the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་བརྒྱ་ཕྲག་དྲུག །གཉིས་པར་བདུན་ཡོད་གསུམ་པར་བྱེ་བ་བརྒྱད། །
en: “In the first congregation there will be six billion, In the second there will be seven billion, and in the third there will be eight billion.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་གཅིག །
en: His lifespan will be twenty-one thousand years,

source: མྱ་ངན་འདས་ནས་དམ་ཆོས་ལོ་ལྔར་བསྒྱུར། །
en: And upon his attaining nirvāṇa the sacred Dharma will remain five years.

source: རྐང་གཉིས་མཆོག་མ་མྱ་ངན་འདས་པ་ཡི། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་བཅུ་དྲུག །
en: “When that supreme human has attained nirvāṇa There will be ninety-six billion stūpas.

source: གསུང་རབ་དག་ནི་འདི་འདྲར་འགྱུར་བ་སྟེ། །སྐྱེ་བོ་སུ་ཡང་ངན་འགྲོར་འགྲོ་མི་འགྱུར། །
en: His teachings will be such That not a single person goes to the lower realms.

source: དེ་བཞིན་གཤེགས་པ་འོད་ལྡན་ཉི་ཟླ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འབྱོར་པའི་སྒྲ་ཞེས་བྱ། །
en: “The thus-gone Candrārka will be born In a place called Sound of Wealth.

source: དེ་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅྭ་བརྒྱད་ཡབ་ནི་ཟླ་བ་ཡིན། །ཏོག་གི་འོད་ཅེས་བྱ་བ་དེ་ཡུམ་ཡིན། །
en: His family will be kṣatriya, And his light will extend eighteen leagues. “Moon will be his father and Crest Light his mother.

source: སྲས་པོ་ལེགས་སེམས་ཚོགས་ཅན་རིམ་གྲོ་པ། །
en: Excellent Mind will be his son and Gatherer his attendant.

source: སྲིད་མཐར་བྱེད་ཅེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Liberator from Existence will be the one of insight

source: མེ་ཏོག་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Flower Light the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་ཚོགས་བྱེ་བ། །གཉིས་པར་བྱེ་ལྔ་གསུམ་པར་བྱེ་བ་བཅུ། །
en: “In the first congregation there will be ten million worthy ones, In the second fifty million, and in the third one hundred million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་དྲུག །འདྲེན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་ཕྲག་གཉིས་བར་དུ་གནས། །
en: His lifespan will be seventy-six thousand years, And when that guide has attained nirvāṇa “The sacred Dharma will remain for twenty million years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །ཕྱོགས་རྣམས་མཆོད་རྟེན་འབུམ་ཕྲག་དགུ་བཅུ་དགུ། །མཆོད་རྟེན་རེ་རེར་གདུགས་ནི་སྟོང་སྟོང་ཡོད། །
en: His relics will be abundant, And there will be nine million nine hundred thousand stūpas in the various directions, Each of them adorned with a thousand parasols.

source: རྒྱལ་བ་ཉི་མའི་འོད་ཅེས་བྱ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འོད་ཟེར་བཅུ་ཞེས་བྱ། །
en: “The victorious Sūryaprabha will be born In a place called Ten Light Rays.

source: དེ་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་ཅུ་རྩ་བརྒྱད་སྐྱེ་དབང་ཡབ། །དེའི་ཡུམ་གསེར་མདོག་ཅེས་ནི་བྱ་བ་ཡིན། །
en: His family will be brahmin, And his light will extend eighty-eight leagues. “Ruler of Men will be his father and Golden Color his mother.

source: མཆོད་པ་སྲས་ཡིན་ལྷུན་པོ་རིམ་གྲོ་པ། །
en: Worship will be his son and Mountain his attendant.

source: བསོད་ནམས་འབྱུང་གནས་ཞེས་བྱ་ཤེས་རབ་ཅན། །
en: Source of Merit will be the one of insight

source: བཟང་པོ་དགའ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Joyous Excellence the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་དགེ་སློང་ཚོགས། །ཁྲི་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་གཉིས་པར་ཡང་། །ཁྲི་ཕྲག་བརྒྱད་ཅུ་གསུམ་པར་ཁྲི་དགུ་བཅུ། །
en: “In the first congregation there will be seven hundred sixty thousand worthy monks, In the second eight hundred thousand, and in the third nine hundred thousand.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་གཉིས། །
en: His lifespan will be ninety-two thousand years,

source: མཆོད་རྟེན་གཅིག་ཏུ་ཟད་ལ་གདུགས་ཀྱི་གྲངས། །སྟོང་ཕྲག་བརྒྱད་ཅུས་དཔག་ཚད་བཞིར་ཡང་ཁྱབ། །
en: There will be a single stūpa Adorned with eighty thousand parasols across four leagues.

source: མི་ཡི་འདྲེན་པ་སྐར་མཁན་ཞེས་བྱ་བའི། །སྐྱེ་ཡུལ་དེ་ཚེ་དགའ་བས་ལྟ་ཞེས་བྱ། །
en: The guide of humans, Jyotiṣka, “Will be born in a place called Looking with Joy.

source: དེ་བཞིན་གཤེགས་རིགས་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །
en: His family will be kṣatriya, And his light will extend nine leagues.

source: དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ལེགས་པའི་ལྷ། །བསོད་ནམས་བློ་གྲོས་ཞེས་བྱ་སྐྱེད་པའི་ཡུམ། །
en: God of Excellence will be his father and Meritorious Intelligence his mother.

source: དེའི་སྲས་སྐྱེ་དབང་མཆོག་མ་རིམ་གྲོ་པ། །
en: “Ruler of Men will be his son and Supreme his attendant.

source: ལྷ་དགའ་ཞེས་ནི་བྱ་བ་ཤེས་རབ་ཅན། །
en: Divine Joy will be the one of insight

source: རྫུ་འཕྲུལ་ཅན་གྱི་མཆོག་མ་ལེགས་བཟངས་ཡིན། །
en: And Exquisite Excellence supreme in terms of miracles.

source: འདུས་པ་དང་པོར་ཉན་ཐོས་ཐེར་འབུམ་ཕྲག །ཁྲི་ཕྲག་དགུ་བཅུ་རྩ་དགུ་འབྱུང་བར་འགྱུར། །
en: In the first congregation there will be ninety-nine trillion,

source: དེ་ཡི་ཕྱིན་ཆད་ཉན་ཐོས་ཚོགས་མཐའ་ཡས། །
en: “And from then on the gathering of hearers will be infinite.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་གྲངས་བྱེ་བ་ཡིན། །
en: His lifespan will be ten million years,

source: འདྲེན་པ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་གསུམ་དུ་གནས། །
en: And when this guide has attained parinirvāṇa The sacred Dharma will remain for thirty million years.

source: མི་ཡི་འདྲེན་པའི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །གདུགས་ནི་བརྒྱ་ཕྲག་ཉི་ཤུ་གཉིས་ཀྱིས་ཁྱབ། །
en: “There will be a single stūpa of this guide of humans, Adorned with two thousand two hundred parasols.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་རྒྱུད་ཅེས་བྱ། །
en: The thus-gone Siṃhaketu will be born In a place called Continuum of Joy.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་རི་དགས་འཛིན། །དེ་ཡི་ཡུམ་ནི་པད་མ་དཀར་ཞེས་བྱ། །
en: “His family will be kṣatriya, And his light will cover one hundred leagues. Deer Holder will be his father and White Lotus his mother.

source: མཛེས་པ་ཞེས་བྱ་དེ་ཡི་སྲས་པོ་ཡིན། །
en: Beautiful will be his son

source: གཟི་བརྗིད་འོད་འཕྲོ་ཞེས་བྱ་རིམ་གྲོ་པ། །
en: “And Radiant Splendor his attendant.

source: མྱ་ངན་མེད་པའི་རི་བོ་ཤེས་རབ་ཅན། །
en: Mountain Free from Suffering will be the one of insight

source: དགེ་བའི་དཔལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Virtuous Glory the one of miracles.

source: འདུས་པ་དང་པོར་ཉན་ཐོས་དྲུག་སྟོང་ཡོད། །གཉིས་པར་ལྔ་སྟོང་གསུམ་པར་བཞི་སྟོང་ཡོད། །
en: In the first congregation there will be six thousand hearers, “In the second five thousand, and in the third four thousand.

source: ཚེ་ཚད་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་གཅིག །
en: His lifespan will be seventy-one thousand years,

source: མྱ་ངན་འདས་ནས་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་ཕྱེད་དང་གཉིས་སུ་གནས། །
en: And upon his attaining nirvāṇa The sacred Dharma will remain for twenty-five million years.

source: རྒྱལ་བ་དེ་ཡི་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་བཅུ་གཉིས། །
en: “The relics of this victor will be abundant, And there will be ninety-two billion stūpas.

source: མི་ཡི་བདག་པོ་དུས་མཁྱེན་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཐོང་ན་དགའ་ཞེས་བྱ། །
en: The lord of humans, Velāmarāja, Will be born in a place called Delightful Sight.

source: དེ་བཞིན་གཤེགས་རིགས་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་ཡབ་ནི་ལྷས་བྱིན་ཡིན། །དེ་ཡི་ཡུམ་ནི་མ་སྨད་པ་ཞེས་བྱ། །
en: “The family of this thus-gone one will be brahmin And his light will cover six leagues. Given by the Gods will be his father and Irreproachable his mother.

source: སྲས་པོ་སྤྲིན་ཡིན་དཔལ་ནི་རིམ་གྲོ་པ། །
en: Cloud will be his son and Glory his attendant.

source: འབར་བ་ཞེས་བྱ་མཁས་པའི་མཆོག་མ་སྟེ། །
en: “Blaze will be the supreme scholar

source: བསམ་གཏན་སྟོབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Strength of Concentration the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་ཟག་ཟད་པ། །ཉོན་མོངས་མེད་པ་བྱེ་བ་ཉི་ཤུ་གཉིས། །
en: In the first congregation there will be two hundred twenty million Worthy ones who have exhausted contaminants and are free from defilements.

source: གཉིས་པར་ཉི་ཤུ་གསུམ་ཡོད་གསུམ་པར་ཡང་། །གཉིས་ཡོད་མི་རྣམས་ཚེ་ཚད་ལོ་ལྔ་བརྒྱ། །
en: “In the second will be two hundred thirty million, and in the third there will be two hundred twenty million. The lifespan of humans will be five hundred years,

source: འཁོར་བ་འཇིག་མཛད་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་ཉིས་སྟོང་བར་དུ་གནས། །
en: And when this destroyer of saṃsāra has attained nirvāṇa The sacred Dharma will remain for two thousand years.

source: དེ་ཡི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །གསེར་གྱི་སྲོག་ཤིང་དཔག་ཚད་གཅིག་ཏུ་འཕགས། །
en: “The relics of this victor will remain together in a single stūpa, The golden life-pillar of which will rise one league tall.

source: སྲིད་མཐར་མཛད་པ་དཔལ་གྱི་སྙིང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྐྱེ་བོ་དགའ་ཞེས་བྱ། །
en: The one who liberates from existence, Śrīgarbha, Will be born in a place called Delighting People.

source: རིགས་ནི་བྲམ་ཟེ་འོད་ནི་དཔག་ཚད་གཅིག །དེ་ཡི་ཡབ་ནི་ཟླ་བའི་སྟོབས་ཞེས་བྱ། །ཨུ་བེ་ཞེས་བྱ་ཡུམ་ཡིན་ཟླ་བ་སྲས། །
en: “His family will be brahmin and his light will cover one league. Moon Power will be his father, Ube his mother, and Moon his son.

source: བརྩོན་འགྲུས་བདེ་བའི་དབང་པོ་རིམ་གྲོ་པ། །
en: Faculty of Joyous Diligence will be his attendant,

source: ནོར་གྱི་འབྱུང་གནས་ཞེས་བྱ་ཤེས་རབ་ཅན། །
en: Wealth Source will be the supreme scholar,

source: བསམ་གཏན་དབང་ཕྱུག་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: “And Master of Meditation the one of miracles.

source: དགོངས་པ་དྲི་མ་མེད་པའི་དགེ་སློང་དག །འདུས་པ་དང་པོར་ལྔ་ཁྲི་བཞི་སྟོང་ཡོད། །
en: In the first congregation there will be fifty-four thousand Monks of stainless realization.

source: གཉིས་པར་དྲུག་ཁྲི་གསུམ་པར་བརྒྱད་ཁྲི་ཡོད། །
en: In the second there will be sixty thousand, and in the third there will be eighty thousand.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ལྔ་བཅུ་ཡིན། །
en: “His lifespan will be fifty thousand years,

source: དམ་པའི་ཆོས་ནི་ལོ་གྲངས་འབུམ་དུ་གནས། །
en: And his sacred Dharma will remain for one hundred thousand years.

source: རྐང་གཉིས་མཆོག་མ་དེ་ཡི་མཆོད་རྟེན་ཡང་། །གཅིག་འབྱུང་དཔག་ཚད་བཞི་ཙམ་ཁོར་ཡུག་ཏུ། །གདུགས་བཀབ་དྲིལ་བུ་གཡེར་ཁའི་དྲ་བས་ཁྱབ། །
en: Covering four leagues, the single stūpa of this supreme human Will be shielded by parasols and draped with nets of bells.

source: དེ་བཞིན་གཤེགས་པ་སྲིད་མཐའ་གཟིགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་མཐོང་ཞེས་བྱ། །
en: “The thus-gone Bhavāntadarśin will be born In a place called Seen with Delight.

source: རིགས་ནི་རྒྱལ་རིགས་འོད་བཟངས་དཔག་ཚད་དག །སུམ་ཅུ་གསུམ་ཡོད་ཡབ་ནི་རྣམ་པར་གནོན། །དེ་ཡི་ཡུམ་ནི་ཟླ་བའི་འདབ་ལྡན་མ། །
en: His family will be kṣatriya, And his light will cover thirty-three leagues. “Subjugator will be his father and Moon Petals his mother;

source: སྲས་པོ་རྗེ་བཙན་སྦེད་པ་རིམ་གྲོ་པ། །
en: Fierce Lord will be his son and Hidden his attendant.

source: སྐྱེ་བའི་འོད་ཅེས་བྱ་བ་མཁས་པའི་མཆོག །
en: Radiant Arising will be the supreme scholar

source: རླུང་ལྟར་འགྲོ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Moving like the Wind the one of miracles.

source: འདུས་པ་དང་པོར་དགེ་སློང་བརྒྱད་ཁྲི་ཡོད། །གཉིས་པར་དགུ་ཁྲི་གསུམ་པར་བྱེ་བ་ཡོད། །
en: “In the first congregation there will be eighty thousand monks, In the second there will be ninety thousand, and in the third there will be ten million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱ་ཡང་ཡིན། །
en: His lifespan will be one hundred thousand years,

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་རྣམས་ཀྱང་། །ལོ་གྲངས་བྱེ་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: And after his attaining nirvāṇa “The sacred Dharma will remain for ten million years.

source: དེ་བཞིན་གཤེགས་པ་ཐེ་ཙོམ་མི་མངའ་བ། །དེ་ཡི་སྐུ་གདུང་རྣམས་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་བཅུ་གཅིག །
en: From this thus-gone one free from doubts Will issue abundant relics And there will be nine hundred and ten billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་གློག་གི་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་སྨན་ཅེས་བྱ་བ་ཡིན། །
en: “The thus-gone Vidyutprabha will be born In a place called Medicine.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་བདེ་བའི་དབང་པོ་ཡབ། །དེ་ཡི་ཡུམ་ནི་ཡན་ལག་དགའ་ཞེས་བྱ། །
en: His family will be kṣatriya, And his light will cover two leagues. “Master of Bliss will be his father and Branches of Joy his mother;

source: སྲས་པོ་སྟོབས་བརྟན་ཆོས་ནི་རིམ་གྲོ་པ། །
en: Firm Strength will be his son and Dharma his attendant.

source: ནོར་ལྷ་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Wealth God will be the supreme scholar

source: སྙན་པར་སེམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Glorious Intent the one of miracles.

source: དེ་ཡི་འདུས་པ་དང་པོར་དགྲ་བཅོམ་པ། །ཉོན་མོངས་ཟད་པ་བརྒྱད་ཅུ་གཉིས་པར་ཡང་། །ཉིས་འགྱུར་གསུམ་པ་དག་ཏུ་སུམ་འགྱུར་ཡོད། །
en: “In the first congregation there will be eighty Worthy ones who have exhausted the defilements. In the second there will be twice that amount, and in the third there will be thrice the same.

source: དེ་ཡི་སྐུ་ཚེ་ལོ་གྲངས་ཉིས་སྟོང་ཡིན། །
en: His lifespan will be two thousand years,

source: རྒྱལ་བ་དེ་ནི་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བཅུར་ཡང་གནས། །
en: “And after that victor has attained nirvāṇa The sacred Dharma will remain for ten thousand years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །གདུགས་གྲངས་བརྒྱ་ཕྲག་དྲུག་ཅུ་གཉིས་ཀྱིས་ཁྱབ། །
en: There will be a single stūpa dedicated to nirvāṇa Shaded by six thousand two hundred parasols.

source: འཇིག་རྟེན་མགོན་པོ་གསེར་གྱི་རི་བོ་དེའི། །སྐྱེ་བའི་ཡུལ་ནི་དྲེགས་པར་བྱེད་ཅེས་བྱ། །
en: “The protector of the world, Kanakaparvata, Will be born in a place called Making Proud.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་གསལ་བ་ཡིན། །དེ་ཡི་ཡུམ་ནི་དགེ་མཆོག་མ་ཞེས་བྱ། །
en: The family of this victor will be brahmin, And his light will cover two leagues. “Luminous will be his father and Supreme Virtue his mother;

source: ཤིན་ཏུ་བཀྲ་ཤིས་སྲས་ཆོས་རིམ་གྲོ་པ། །
en: Perfectly Auspicious will be his son and Dharma his attendant.

source: ཆོས་འཕགས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Superior Dharma will be the scholar

source: མི་ཡི་ཏོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Crest of Humanity the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་པ་ཡི་ཚོགས། །སྟོང་ཕྲག་སུམ་ཅུ་དག་ནི་འབྱུང་བར་འགྱུར། །འདུས་པ་གཉིས་པར་ཉི་ཤུ་རྩ་བརྒྱད་ཡོད། །འདུས་པ་གསུམ་པར་ཚོགས་པ་ཉི་ཤུ་ཡོད། །
en: “In the first congregation thirty thousand worthy ones will gather; In the second will be twenty-eight thousand, And in the third there will be twenty thousand.

source: དེ་ཡི་སྐུ་ཚེ་ལོ་གྲངས་དགུ་སྟོང་ཡིན། །
en: His lifespan will be nine thousand years,

source: དམ་པའི་ཆོས་ནི་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །སུམ་ཅུ་རྩ་གཉིས་ཐམ་པར་གནས་འགྱུར་ཞིང་། །
en: “And his sacred Dharma will remain intact For thirty-two thousand years.

source: དེ་ཡི་སྐུ་གདུང་རྣམས་ཀྱང་རྒྱས་པར་འགྱུར། །
en: Also, his relics will be abundant.

source: སྤྱན་དང་ལྡན་པ་སེང་གེས་བྱིན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱ། །
en: The one of vision, Siṃhadatta, “Will be born in a place called Supreme Jewel.

source: མགོན་པོའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་རྩ་ལྔ་ཆོས་ལྡན་ཡབ། །ཡུམ་ནི་ཟླ་ལྡན་སྲས་ནི་རིན་པོ་ཆེ། །རིམ་གྲོ་པ་ནི་གློག་འགྱུ་ཞེས་ཀྱང་བྱ། །
en: This protector’s family will be kṣatriya And his light will cover sixty-five leagues. Endowed with Dharma will be his father and Moon Possessor his mother; “Jewel will be his son and Lightning his attendant.

source: དེ་ཚེ་མཁས་གྱུར་དགའ་བ་བློ་ཞེས་བྱ། །
en: Joyous Wisdom will be the scholar

source: དགའ་ཆེན་ཞེས་བྱ་དེ་ཡི་རྫུ་འཕྲུལ་ཅན། །
en: And Great Joy the one of miracles.

source: འདུས་པ་དང་པོར་ཡང་སྲིད་ཟད་པ་ཡི། །དགེ་སློང་ཚོགས་པ་འབུམ་ཕྲག་བཞི་བཅུ་ཡོད། །
en: In the first congregation there will be four million monks “Who have exhausted existence.

source: འདུས་པ་གཉིས་པར་འབུམ་ཕྲག་བཞི་བཅུ་གཉིས། །འདུས་པ་གསུམ་པར་འབུམ་ཕྲག་བཞི་བཅུ་གསུམ། །
en: In the second will be four million two hundred thousand And in the third there will be four million three hundred thousand.

source: མི་རྣམས་ཚེ་ཚད་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ། །
en: The lifespan of humans will be ten thousand years.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: “After this thus-gone one has attained nirvāṇa His sacred Dharma will remain for eighty thousand years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་གཅིག་ཏུ་ཟད། །
en: There will be a single stūpa dedicated to nirvāṇa.

source: བདེ་གཤེགས་གཞན་གྱིས་མི་ཐུབ་རྒྱལ་མཚན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་ལྡན་ཞེས་བྱ། །
en: The well-gone Aparājita­dhvaja will be born In a place called Endowed with Flowers.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཅིག་ཡོད་ཡབ་ནི་ཚོགས་དབང་པོ། །དེའི་ཡུམ་ལུས་མཆོག་ཅེས་ནི་བྱ་བ་ཡིན། །
en: His family will be kṣatriya, And his light will extend one league. “Master of the Gathering will be his father and Supreme Body his mother;

source: ཡོན་ཏན་སྟོབས་སྲས་སྒྲ་གཅན་རིམ་གྲོ་པ། །
en: Strength of Qualities will be his son and Rāhu his attendant.

source: ཁ་ལོ་སྒྱུར་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Leader will be the scholar

source: སྤྲིན་པོ་ཆེ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Great Cloud the one of miracles.

source: འདུས་པ་དང་པོར་དྲང་སྲོང་མཆོག་དགྲ་བཅོམ། །ཚོགས་པ་བྱེ་བ་བརྒྱ་ཕྲག་གསུམ་ཡང་ཡོད། །གཉིས་པར་གཉིས་ཡོད་གསུམ་པར་བྱེ་བརྒྱ་གཅིག །
en: “In the first congregation there will be three billion Supreme sages who are worthy ones. In the second will be two billion, and in third, one billion.

source: དེ་ཚེ་མི་ཚེ་ལོ་གྲངས་སྟོང་ཡིན་ནོ། །
en: At that time the lifespan of humans will be one thousand years.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: “After he has attained nirvāṇa, His sacred Dharma will remain for three thousand years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་བྱེ་བ་སྟེ། །སྐུ་གདུང་དམ་པ་རྣམས་ཀྱང་འཕེལ་བར་འགྱུར། །
en: There will be ten million stūpas dedicated to nirvāṇa And the sacred relics will increase.

source: དེ་བཞིན་གཤེགས་པ་མཆོག་དགའ་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Pramodyakīrti will be born In a place called Endowed with Merit.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་འདྲོན་བཟངས་ཡིན། །དེ་ཡི་ཡུམ་ནི་སྤྲིན་ལྡན་མ་ཞེས་བྱ། །
en: The family of this victor will be kṣatriya, And his light will cover ten leagues. “Fine Feast will be his father and Cloud Bearer his mother;

source: སྲས་ནི་རྒྱལ་པོ་སྐྱེ་ལྡན་རིམ་གྲོ་པ། །
en: King will be his son and Living Being his attendant.

source: ཚུལ་ཁྲིམས་དགའ་ཞེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Joyous Discipline will be the one of insight

source: བདུད་རྩི་སྟོབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Nectar Strength the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་ཕྲག་དྲུག་ཡོད། །
en: “In the first congregation there will be sixty million,

source: གཉིས་པར་ལྔ་ཡོད་གསུམ་པར་གཉིས་ཡོད་དོ། །
en: In the second there will be fifty million, and in the third there will be twenty million.

source: དེ་ཡི་ཚེ་ན་འདྲེན་པའི་སྐུ་ཚེའི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་གཉིས་ཡིན། །
en: At that time the lifespan of the guide Will be eighty-two thousand years.

source: འདྲེན་པ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་ཕྲག་གཉིས་གནས། །
en: “After the guide has attained nirvāṇa, The sacred Dharma will remain for twenty million years.

source: མཆོད་རྟེན་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཏེ། །རྒྱལ་མཚན་གྱིས་བརྒྱན་གདུགས་སྟོང་དག་གིས་ཁྱབ། །
en: There will be seven million two hundred thousand stūpas Adorned with banners and shaded by thousands of parasols.

source: ཡོན་ཏན་མཐའ་ཡས་བརྩོན་འགྲུས་བརྟན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་སྡུག་ཅེས་ཀྱང་བྱ། །
en: “The one of infinite qualities, Dṛḍhavīrya, Will be born in a place called Delightful Joy.

source: དེ་བཞིན་གཤེགས་རིགས་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཅིག་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །དེ་ཡི་ཡུམ་ནི་མེ་ཏོག་ལྡན་ཞེས་བྱ། །
en: The family of this thus-gone one will be kṣatriya, And his light will cover one league. “Freedom from Suffering will be his father and Endowed with Flowers his mother.

source: སྲས་པོ་འབྱོར་ལྡན་གྲགས་པ་རིམ་གྲོ་པ། །
en: Wealthy will be his son and Fame his attendant.

source: འོད་བྱེད་རྒྱལ་པོ་ཞེས་བྱ་ཤེས་རབ་ཅན། །
en: Radiant King will be the one of insight

source: ལེགས་དོན་སྤྱོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Practice of the Good Objective the one of miracles.

source: དགེ་སློང་ཚོགས་པ་བྱེ་བརྒྱ་ལྔ་བཅུ་དྲུག །དེ་ཚེ་འདུས་པ་གཉིས་པར་ལྔ་བཅུ་ཡོད། །འདུས་པ་གསུམ་པར་ལྔ་བཅུ་རྩ་བཞི་ཡོད། །
en: “Five billion six hundred million monks will gather. In the second congregation will be five billion, And in the third there will be five billion four hundred million.

source: མི་རྣམས་ཚེ་ཚད་ལོ་གྲངས་སྟོང་ཕྲག་གསུམ། །
en: At that time the lifespan of humans will be three thousand years.

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་ཀྱི་ཚུལ། །ལོ་གྲངས་བྱེ་བ་ཕྲག་ནི་བཞི་བཅུར་གནས། །
en: “After he has attained nirvāṇa, His sacred Dharma will remain for four hundred million years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་གཅིག་བྱུང་ལ། །དཔག་ཚད་གསུམ་ཙམ་ཁོར་ཡུག་གདུགས་ཀྱིས་བརྒྱན། །
en: There will be a single stūpa dedicated to nirvāṇa, Measuring three leagues and adorned with parasols throughout.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་རྫོགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་བཟངས་དབུས་ཞེས་བྱ། །
en: “The thus-gone Saṃpannakīrti will be born In a place called Center of the Land of Excellence.

source: དཔག་ཚད་གཅིག་ཡོད་ཡབ་ནི་སྡོང་བུ་ཡིན། །དཔེ་མེད་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: And his light will cover one league. “Tree Trunk will be his father and Incomparable his mother;

source: ལྷ་དགའ་ཞེས་ནི་བྱ་བ་སྲས་པོ་ཡིན། །
en: Divine Joy will be his son

source: བདེ་བར་འཚོ་ལྡན་ཞེས་བྱ་རིམ་གྲོ་པ། །
en: And Joyful Sustenance his attendant.
